; Лабораторная работа 3. Предикаты и функционалы.
; ВАРИАНТ 4

; В теле функции использование операторов SET, LET и SETQ не допускается! Все функции должны быть рекурсивными,
; функционалы не использовать.

; Задание 2  - Определите предикат, проверяющий, является ли одно множество подмножеством другого.

; Задание 7  - Определите функцию, возвращающую симметрическую разность двух множеств, т.е. множество из
;              элементов, не входящих в оба множества.

; Задание 12 - Определите функционал, аналогичный предикату MAPLIST для одноуровнего списка.
;              (Используйте применяющий функционал FUNCALL).
