% Лабораторная работа 5. Рекурсия, списки.

% Задание 1 - Написать предикат, который печатает все нечётные числа из диапазона в порядке
%             убывания. Границы диапазона вводятся с клавиатуры в процессе работы предиката.

% Задание 2 - Написать предикат, который находит числа Фибоначчи по их номерам, которые в
%             цикле вводятся с клавиатуры. Запрос номера и нахождение соответствующего числа
%             Фибоначчи должно осуществляться до тех пор, пока не будет введено отрицательное
%             число.
%             Циклический ввод организовать с помощью предиката repeat.
%             Числа Фибоначчи определяются по следующим формулам:
%             F(0)=1, F(1)=1, F(i)=F(i-2)+F(i-1) (i=2,3,4,...).

% Задание 3 - Написать предикат, который разбивает числовой список по двум числам, вводимым с
%             клавиатуры на три списка: меньше меньшего введенного числа, от меньшего
%             введенного числа до большего введенного числа, больше большего введенного числа.
%             Список и два числа вводятся с клавиатуры в процессе работы предиката.
%             Например: [3,7,1,-3,5,8,0,9,2],8,3 => [1,-3,0,2],[3,7,5,8],[9].

% Задание 4 - Написать предикат, который формирует список из наиболее часто встречающихся
%             элементов списка. Список вводится с клавиатуры в процессе работы предиката.
%             Встроенные предикаты поиска максимума и сортировки не использовать!
%             Например: [0,3,5,7,1,5,3,0,3,3,5,7,0,5,0] => [0,3,5].
